app/controllers/holidays_controller.rb

  def index
    login_required
    @holiday = Holiday.all
---
SELECT * FROM "holidays"

  def show
    login_required
    @holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)

  def edit
    login_required
    @holiday = Holiday.find(params[:id])
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 6)

  def destroy
    login_required
    @holiday = Holiday.find(params[:id])
    @holiday.destroy
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 1)
DELETE FROM "holidays" WHERE "id" = 1

  def create
    @holiday = Holiday.create(params[:holiday])
    @holiday.user_id = current_user.id
    if @holiday.save
---
INSERT INTO "holidays" ("created_at", "photo_file_size", "enddate", "updated_at", "photo_file_name", "photo_content_type", "approved", "amountofdays", "user_id", "photo_updated_at", "startdate") VALUES('2012-04-10 13:08:04', 13485, '2012-05-05', '2012-04-10 13:08:04', 'lol.png', 'image/png', NULL, 4, NULL, '2012-04-10 13:08:04', '2012-05-05')
UPDATE "holidays" SET "updated_at" = '2012-01-23 12:07:54', "user_id" = 1 WHERE "id" = 10

  def update
    @holiday = Holiday.find(params[:id])
    if @holiday.save
---
SELECT * FROM "holidays" WHERE ("holidays"."id" = 3)
UPDATE "holidays" SET "updated_at" = '2012-04-12 15:08:19', "photo_file_name" = '280px-PNG_transparency_demonstration_1.png', "photo_file_size" = 44454, "photo_updated_at" = '2012-04-12 15:08:19' WHERE "id" = 622